bookers/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "successfully"
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "rwrafewa"], ["body", "qesda"], ["created_at", "2020-01-14 11:11:26.931431"], ["updated_at", "2020-01-14 11:11:26.931431"]]
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
    if book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "ｊへｗｆはえｗｆｂ"], ["updated_at", "2020-01-14 11:50:22.468090"], ["id", 17]]